amarildolacerda/bridge_python/clients/esp8266_on_off/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <ArduinoJson.h>
#include <WiFiManager.h>
#include <WiFiUdp.h>
#include <EEPROM.h>
#include <ArduinoOTA.h>
#include "config.h"
#include "pages.h"

static const char *TAG = "esp8266-bridge";

static WiFiClient s_wifi;
static HTTPClient s_http;
static WiFiUDP s_udp;

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_broadcast_check = 0;
static unsigned long s_last_command_poll = 0;
static unsigned long s_last_bridge_reconnect = 0;

static bool s_onoff_state = false;
static float s_temperature = 25.0;
static float s_humidity = 50.0;
static int s_dimmer_level = 128;
static int s_battery = 100;
static unsigned long s_start_time = 0;
static unsigned long s_last_send_ms = 0;

static char s_device_id[32];
static char s_device_name[48] = DEVICE_NAME;

static char s_bridge_host[64] = BRIDGE_HOST;
static uint16_t s_bridge_port = BRIDGE_PORT;
static bool s_bridge_discovered = false;
static bool s_bridge_connected = false;

static bool s_pending_register_state = false;
static bool s_wifi_configuration_mode = false;
static unsigned long s_wifi_config_start_time = 0;

volatile bool s_button_pressed = false;
volatile unsigned long s_last_interrupt = 0;

static bool s_pending_state_sync = false;

static ESP8266WebServer s_server(80);

static void button_isr(void);
static void send_state(bool force_log = false);

static const char *get_device_type_string(void)
{
#if DEVICE_TYPE == DEVICE_TYPE_ONOFF
    return "onoff";
#elif DEVICE_TYPE == DEVICE_TYPE_TEMPERATURE
    return "temperature";
#elif DEVICE_TYPE == DEVICE_TYPE_CONTACT
    return "contact";
#elif DEVICE_TYPE == DEVICE_TYPE_OCCUPANCY
    return "occupancy";
#elif DEVICE_TYPE == DEVICE_TYPE_DIMMABLE
    return "dimmable";
#else
    return "onoff";
#endif
}

#define EEPROM_NAME_ADDR 0
#define EEPROM_NAME_MAX 48

static void save_device_name(const char *name)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_NAME_ADDR, 0xFF);
    for (int i = 0; i < EEPROM_NAME_MAX - 1; i++) {
        EEPROM.write(EEPROM_NAME_ADDR + 1 + i, name[i]);
        if (name[i] == '\0') break;
    }
    EEPROM.write(EEPROM_NAME_ADDR + EEPROM_NAME_MAX, '\0');
    EEPROM.commit();
    EEPROM.end();
}

static bool is_valid_name(const char *s)
{
    if (!s || s[0] == '\0') return false;
    for (int i = 0; s[i]; i++) {
        char c = s[i];
        if (c < 32 || c > 126) return false;
    }
    return true;
}

static void load_device_name(void)
{
    EEPROM.begin(128);
    uint8_t marker = EEPROM.read(EEPROM_NAME_ADDR);
    if (marker == 0xFF) {
        char buf[EEPROM_NAME_MAX];
        for (int i = 0; i < EEPROM_NAME_MAX - 1; i++) {
            buf[i] = EEPROM.read(EEPROM_NAME_ADDR + 1 + i);
            if (buf[i] == '\0') break;
        }
        buf[EEPROM_NAME_MAX - 1] = '\0';
        if (is_valid_name(buf)) {
            strncpy(s_device_name, buf, sizeof(s_device_name) - 1);
            s_device_name[sizeof(s_device_name) - 1] = '\0';
        }
    }
    EEPROM.end();
}

static bool http_post(const char *path, const String &body)
{
    s_http.begin(s_wifi, String("http://") + s_bridge_host + ":" + s_bridge_port + path);
    s_http.addHeader("Content-Type", "application/json");
    s_http.setTimeout(5000);
    int code = s_http.POST(body);
    bool ok = (code == 200);
    s_bridge_connected = ok;
    if (!ok)
    {
        Serial.printf("[%s] POST %s -> %d\n", TAG, path, code);
    }
    s_http.end();
    return ok;
}

static bool register_device(void)
{
    String body;
    {
        JsonDocument doc;
        doc["id"] = s_device_id;
        doc["type"] = get_device_type_string();
        doc["name"] = s_device_name;
        doc["ip"] = WiFi.localIP().toString();
        serializeJson(doc, body);
    }
    Serial.printf("[%s] Registering device: %s\n", TAG, s_device_id);
    bool ok = http_post("/api/device/register", body);
    if (ok)
    {
        Serial.printf("[%s] Device registered successfully\n", TAG);
    }
    else
    {
        Serial.printf("[%s] Failed to register device\n", TAG);
    }
    return ok;
}

static void send_state(bool force)
{
    if (!s_bridge_discovered || !s_bridge_connected)
        return;

    const char *type = get_device_type_string();

    static bool s_last_onoff = false;
    static int s_last_level = -1;
    static float s_last_temp = -999;
    static float s_last_hum = -999;

    bool changed = false;
    if (strcmp(type, "onoff") == 0 || strcmp(type, "contact") == 0 || strcmp(type, "occupancy") == 0)
    {
        changed = (s_onoff_state != s_last_onoff);
    }
    else if (strcmp(type, "dimmable") == 0)
    {
        changed = (s_onoff_state != s_last_onoff || s_dimmer_level != s_last_level);
    }
    else if (strcmp(type, "temperature") == 0)
    {
        changed = (abs(s_temperature - s_last_temp) > 0.1 || abs(s_humidity - s_last_hum) > 0.1);
    }

    if (!changed && !force)
        return;

    String body;
    {
        JsonDocument doc;
        doc["id"] = s_device_id;

        if (strcmp(type, "onoff") == 0)
        {
            doc["on"] = s_onoff_state;
        }
        else if (strcmp(type, "dimmable") == 0)
        {
            doc["on"] = s_onoff_state;
            doc["level"] = s_dimmer_level;
        }
        else if (strcmp(type, "temperature") == 0)
        {
            doc["temperature"] = s_temperature;
            doc["humidity"] = s_humidity;
        }
        else if (strcmp(type, "contact") == 0)
        {
            doc["contact"] = s_onoff_state;
        }
        else if (strcmp(type, "occupancy") == 0)
        {
            doc["occupancy"] = s_onoff_state;
        }

        serializeJson(doc, body);
    }

    if (http_post("/api/device/state", body))
    {
        if (strcmp(type, "onoff") == 0 || strcmp(type, "contact") == 0 || strcmp(type, "occupancy") == 0)
        {
            s_last_onoff = s_onoff_state;
        }
        else if (strcmp(type, "dimmable") == 0)
        {
            s_last_onoff = s_onoff_state;
            s_last_level = s_dimmer_level;
        }
        else if (strcmp(type, "temperature") == 0)
        {
            s_last_temp = s_temperature;
            s_last_hum = s_humidity;
        }

        s_last_send_ms = millis();
        if (strcmp(type, "onoff") == 0)
            Serial.printf("[%s] %s\n", TAG, s_onoff_state ? "ON" : "OFF");
        else if (strcmp(type, "dimmable") == 0)
            Serial.printf("[%s] %s  level=%d\n", TAG, s_onoff_state ? "ON" : "OFF", s_dimmer_level);
        else if (strcmp(type, "temperature") == 0)
            Serial.printf("[%s] temp=%.1f hum=%.1f\n", TAG, s_temperature, s_humidity);
        else if (strcmp(type, "contact") == 0)
            Serial.printf("[%s] %s\n", TAG, s_onoff_state ? "OPEN" : "CLOSED");
        else if (strcmp(type, "occupancy") == 0)
            Serial.printf("[%s] %s\n", TAG, s_onoff_state ? "MOTION" : "CLEAR");
    }
}

static void poll_commands(void)
{
    if (!s_bridge_connected)
        return;

